package com.github.stagirs.lingvo.model;

/**
 * Created by must on 12.12.2016.
 */
public enum Type {
    POST("Часть речи"),
    ANim("Одушевлённость"),
    GNdr("Род"),
    NMbr("Число"),
    CAse("Падеж"),
    Abbr("Аббревиатура"),
    ASpc("Вид"),
    TRns("Категория переходности"),
    PErs("Лицо"),
    TEns("Время"),
    MOod("Категория наклонения"),
    INvl("Категория совместности"),
    VOic("Категория залога"),
    
    Subx("возможна субстантивация"),
    Supr("превосходная степень"),
    Qual("качественное"),
    Apro("местоименное"),
    Anum("порядковое"),
    Poss("притяжательное"),
    Impe("безличный"),
    
    Infr("разговорное"),
    Slng("жаргонное"),
    Arch("устаревшее"),
    Litr("литературный вариант"),
    
    Ques("вопросительное"),
    Dmns("указательное"),
    Prnt("вводное слово"),
    
    Fimp("деепричастие от глагола несовершенного вида"),
    
    Name("имя"),
    Surn("фамилия"),
    Patr("отчество"),
    
    Geox("топоним"),
    Orgn("организация"),
    Trad("торговая марка"),
    
    Error("Ошибка"),
    
    Other("Другие характеристики");

    String description;

    Type(String des) {
        description = des;
    }
}